Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [12]:
pip install pandas

Requirement already satisfied: pandas in /opt/conda/lib/python3.10/site-packages (1.5.2)
Requirement already satisfied: python-dateutil>=2.8.1 in /opt/conda/lib/python3.10/site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in /opt/conda/lib/python3.10/site-packages (from pandas) (2022.6)
Requirement already satisfied: numpy>=1.21.0 in /opt/conda/lib/python3.10/site-packages (from pandas) (1.23.5)
Requirement already satisfied: six>=1.5 in /opt/conda/lib/python3.10/site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [13]:
import pandas as pd
l = [ 4, 8, 15, 16, 23, 42]
pd.Series(l)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

In [14]:
l1 = [45,65,23,89,234,56,345,67,12,876]
pd.Series(l1)

0     45
1     65
2     23
3     89
4    234
5     56
6    345
7     67
8     12
9    876
dtype: int64

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

DATA FRAME CONTAINS THE MULTIPLE COLUMNS AND RECORDS. AND IT IS DIIFERENT FROM PANDAS.SERIES AS SERIES CONTAINS ONLY ONE RECORD OR COLUMN.

In [28]:
import pandas as pd
l = [4378,4387,4853,5794,5489]
pd.Series(l)   #THIS IS AN EXAMPPLE OF SERIES

0    4378
1    4387
2    4853
3    5794
4    5489
dtype: int64

In [51]:
l = ['NAME','HARDIKA','AMYRAA','KINJAL'] , ['ADDRESS','MUMBAI','DELHI','PUNE']
pd.DataFrame(l)  #THIS IS AN EXAMPLE OF DATFRAME

         0        1       2       3
0     NAME  HARDIKA  AMYRAA  KINJAL
1  ADDRESS   MUMBAI   DELHI    PUNE

Q3. Create a Pandas DataFrame that contains the following data:


Name
Alice
Bob
Claire

Age
25
30
27

Gender
Female
Male
Female

In [52]:
df = ['NAME','ALICE','BOB','CLAIRE'] , ['AGE',25, 30, 27] , ['GENDER','FEMALE','MALE','FEMALE']
pd.DataFrame(df)

        0       1     2       3
0    NAME   ALICE   BOB  CLAIRE
1     AGE      25    30      27
2  GENDER  FEMALE  MALE  FEMALE

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

In [54]:
df = ['NAME','ALICE','BOB','CLAIRE'] , ['AGE',25, 30, 27] , ['GENDER','FEMALE','MALE','FEMALE'] , ['CONTACT_NO',7059697054,3565838275,9827590692] , ['INSTITUTE_NAME','VIT INSTITUTE','MIT UNIVERSITY','JAIN UNIVERSITY'] , ['ADDRESS','MUMBAI','DELHI','PUNE']
pd.DataFrame(df)

                0              1               2                3
0            NAME          ALICE             BOB           CLAIRE
1             AGE             25              30               27
2          GENDER         FEMALE            MALE           FEMALE
3      CONTACT_NO     7059697054      3565838275       9827590692
4  INSTITUTE_NAME  VIT INSTITUTE  MIT UNIVERSITY  JAIN UNIVERSITY
5         ADDRESS         MUMBAI           DELHI             PUNE

THE FUNCTIONS THAT ARE USED FOR MANIPULATINFG THE DATA IN PANDAS:
head function is used for getting the first records of data.
tail function is used for getting the last records of data.
read function is used to read the data
column function is used to get the columns of data.
row function is used to get the rows of data.

Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

SO, HERE DATAFRAME AND PANEL IS MUTABLE AND SERIES IS IMMUTABLE.
MUTABLE MEANS THE VALUE CAN BE CHANGED AND IMMUTABLE VICEVERSA.

Q7. Create a DataFrame using multiple Series. Explain with an example.

In [80]:
import pandas as pd
author = ['JITENDRA','PURNIMA','JOSEPH']
article = [210,465,896]

frame = {'AUTHOR': author,
        'ARTICLE': article}

result = pd.DataFrame(frame)
result

     AUTHOR  ARTICLE
0  JITENDRA      210
1   PURNIMA      465
2    JOSEPH      896

In [98]:
import pandas as pd
author = ['JITENDRA','PURNIMA','JOSEPH']
article = [210,465,896]
price = []

result = pd.DataFrame(frame)

     AUTHOR  ARTICLE
0  JITENDRA      210
1   PURNIMA      465
2    JOSEPH      896